snappy-merge-meshes/two-blocks/system/blockMeshDict
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  object blockMeshDict;
}

convertToMeters 1.0;

// Inlet points
ximin -0.15;
ximax -0.1;

// Outlet points
xomin 0.1;
xomax 0.16;

ymin -0.03;
ymax 0.03;

zmin -0.025;
zmax 0.025;

vertices
(
  // Inlet block points
  ($ximin $ymin $zmin)
  ($ximax $ymin $zmin)
  ($ximax $ymax $zmin)
  ($ximin $ymax $zmin)
  ($ximin $ymin $zmax)
  ($ximax $ymin $zmax)
  ($ximax $ymax $zmax)
  ($ximin $ymax $zmax)

  // Outlet block points
  ($xomin $ymin $zmin)
  ($xomax $ymin $zmin)
  ($xomax $ymax $zmin)
  ($xomin $ymax $zmin)
  ($xomin $ymin $zmax)
  ($xomax $ymin $zmax)
  ($xomax $ymax $zmax)
  ($xomin $ymax $zmax)

);

blocks
(
  hex (0 1 2 3 4 5 6 7) (50 60 50) simpleGrading (1 1 1)
  hex (8 9 10 11 12 13 14 15) (60 60 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  inlet
  {
    type patch;
    faces
    (
      (0 3 7 4)
    );
  }

  inlet-walls
  {
    type wall;
    faces
    (
      (0 1 2 3)
      (3 2 6 7)
      (4 5 6 7)
      (0 1 5 4)
    );
  }

  inlet-outlet
  {
    type wall;
    faces
    (
      (1 2 6 5)
    );
  }

  outlet-inlet
  {
    type wall;
    faces
    (
      (8 11 15 12)
    );
  }

  outlet-walls
  {
    type wall;
    faces
    (
      (8 9 10 11)
      (11 10 14 15)
      (12 13 14 15)
      (8 9 13 12)
    );
  }

  outlet
  {
    type patch;
    faces
    (
      (9 10 14 13)
    );
  }
);

mergePatchPairs
(
);

// vi: set ft=foam et sw=2 ts=2 sts=2:
