snappy-merge-meshes/two-blocks/0.org/U
FoamFile
{
  version 2.0;
  format ascii;
  class volVectorField;
  object U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);

boundaryField
{
  movingWall
  {
    type fixedValue;
    value uniform (1 0 0);
  }

  fixedWalls
  {
    type noSlip;
  }

  frontAndBack
  {
    type empty;
  }
}

// vi: set ft=foam et sw=2 ts=2 sts=2:
