snappy-merge-meshes/two-blocks/system/fvSolution
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  location "system";
  object fvSolution;
}

solvers
{
  p
  {
    solver PCG;
    preconditioner DIC;
    tolerance 1e-06;
    relTol 0.05;
  }

  pFinal
  {
    $p;
    relTol 0;
  }

  U
  {
    solver smoothSolver;
    smoother symGaussSeidel;
    tolerance 1e-05;
    relTol 0;
  }
}

PISO
{
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
}

// vi: set ft=foam et sw=2 ts=2 sts=2:
